
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры       

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если  Данные.ДействуетНаОсновании <> "" Тогда
		СтандартнаяОбработка = Ложь;
		Представление = СтрШаблон("%1 (на осн. %2)", Данные.Наименование, Данные.ДействуетНаОсновании);  
    КонецЕсли;

КонецПроцедуры

#КонецОбласти